paulusTecnion/uberlogger-stm32/Core/Src/main.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

  /*
 * MIT License
 *
 * Copyright (c) 2025 Tecnion Technologies
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
 * SOFTWARE.
 */

 
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "esp32_interface.h"
#include "stdint.h"
#include "string.h"
#include <time.h>
#include "spi_ctrl.h"
#include "iirfilter.h"
#include "adc_comp_lut.h"
#include "framing.h"
#include "acquisition.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;
DMA_HandleTypeDef hdma_spi1_tx;
DMA_HandleTypeDef hdma_spi1_rx;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim14;
TIM_HandleTypeDef htim16;

/* USER CODE BEGIN PV */
TIM_HandleTypeDef htim3_bak;
uint8_t MainState = MAIN_IDLE, NextState = MAIN_IDLE;
uint8_t logging_en = 0;
uint8_t msgRx = 0;
uint8_t cmd_buffer[ 20];
//spi_cmd_t cmd_buffer;

ADC_HandleTypeDef hadc1_bak;

uint8_t main_exit_config = 0;

volatile uint16_t data_buffer_write_ptr = 0;
volatile uint32_t time_result_write_ptr = 0;
volatile uint16_t ext_trigger_input = DIGITAL_IN_0_Pin;
uint8_t ext_trigger_input_value = 0;
uint8_t ext_trigger_input_value_debounced = 0;

static uint8_t _singleshot = 0;
uint8_t _trigger_mode = TRIGGER_MODE_CONTINUOUS; // indicates if trigger mode is disabled (TRIGGER_MODE_CONTINUOUS) or by external trigger (TRIGGER_MODE_EXTERNAL)
uint32_t _debounce_time_ext_input = 0;
uint32_t _debounce_prev_time = 0 ;

uint16_t tim3_counter = 0;
uint8_t tim14_event = 0;

log_mode_t logMode = LOGMODE_CSV;
uint8_t _data_lines_per_transaction = DATA_LINES_PER_SPI_TRANSACTION;

extern uint8_t spi_ctrl_state;
uint8_t overrun = 0;
uint8_t datardypin;
uint16_t tbuffer[8];

adc_resolution_t adc_resolution = ADC_12_BITS;
adc_channel_range_t adc_voltage_range_g = ADC_RANGE_10V;
uint16_t adcCounter = 0;

extern lut_t * active_lut_table[NUM_ADC_CHANNELS];

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM3_Init(void);
static void MX_RTC_Init(void);
static void MX_TIM14_Init(void);
static void MX_TIM16_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// The ADC/TIM3 sample path and its HAL weak callbacks
// (HAL_TIM_PeriodElapsedCallback, HAL_ADC_ConvHalfCpltCallback,
// HAL_ADC_ConvCpltCallback, HAL_ADC_ErrorCallback, and the former Adc_start)
// now live in acquisition.c.



void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
			logging_en = 1;
	}
}

void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
	if (GPIO_Pin == STM_ADC_EN_Pin)
	{
		//HAL_SPI_DMAStop(&hspi1);

		logging_en = 0;

	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM3_Init();
  MX_RTC_Init();
  MX_TIM14_Init();
  MX_TIM16_Init();
  /* USER CODE BEGIN 2 */


  // Set MISO pin drive strenght to High speed (bit 8 and 9 = '10' (bit 9 = 1))
  GPIOB->OSPEEDR |= (0x0200);

  // Backup current adc settings
  hadc1_bak = hadc1;



  iir_init();


  HAL_TIM_Base_Start(&htim14);
  HAL_TIM_Base_Start(&htim16);


  // Turn off the interrupt flag for timer 14.
  CLEAR_BIT(TIM14->DIER, TIM_DIER_UIE);
  CLEAR_BIT(TIM16->DIER, TIM_DIER_UIE);

  frame_init();


  acq_init();

  /* USER CODE END 2 */

